class GamePhrase:
    game_offer = "Сыграем в BlackJack? 😉"
    game_is_on = "Игра уже идёт, алло 🤨"
    game_is_off = "В данный момент нет активной игры"
    game_begun = "Да начнется битва! %0A" + "Весь чат в труху! %0A"
    wait_players = "Кто будет участвовать? %0A" + "Жду заявок 15 секунд..."
    game_abort = "Игра отменена %0A"
    game_cancel = "Игра остановлена %0A" + "Кого в этом винить: "
    rules = (
        "В гугле забанили? %0A%0A" + "https://ru.wikihow.com/играть-в-блэкджек"
    )
    no_players = "Никто не откликнулся. Не больно-то и хотелось 🖕"
    player_registered = " будет играть, отлично!"
    player_unregistered = " не участвует, ок"
    player_already_registered = "Вы зарегистрированы, "
    active_players = "Участники:  %0A"
