class GamePhrase:
    game_offer = "Сыграем в BlackJack? 😉"
    game_is_on = "Игра уже идёт, алло 🤨"
    game_is_off = "В данный момент нет активной игры"
    game_begun = "Да начнется битва! %0A" + "Весь чат в труху! %0A"
    wait_players = "Кто будет участвовать? %0A" + "Жду заявок 15 секунд..."
    game_abort = "Игра отменена %0A"
    game_cancel = "Игра остановлена %0A" + "Кого в этом винить: "
    rules = (
        "В гугле забанили? %0A%0A" + "https://ru.wikihow.com/играть-в-блэкджек"
    )
    no_players = "Никто не откликнулся. Не больно-то и хотелось 🖕"
    player_registered = " будет играть, отлично!"
    player_unregistered = " не участвует, ок"
    player_already_registered = "Вы зарегистрированы, "
    active_players = "Участники:  %0A"
    wait_bets = "$ Принимаю ваши ставки $ %0A"
    show_cash = ", на вашем балансе: $"
    no_cash = ", нищеброды не играют 😎"
    to_much_bet = "У вас нет столько денег, "
    bet_accepted = " ставит $"
    bet_accepted_already = ", вы уже поставили $"
    not_a_player = (
        ", вы не зарегистрированы в качестве игрока, чего вы ждали? 🤨"
    )
    zero_bet = "Нет, вы не можете поставить ноль, "
    no_bet = "! Пока вы не сделаете ставку игра не продолжится"


# TODO переделать в функции, чтобы подставлять имена, а то говно какое-то
